"CIAdditionCompositing" = "Añade componentes de color para obtener un efecto de brillo. Normalmente se usa para añadir resaltados y efectos de destello de lente.";"CIAffineClamp" = "Realiza una transformación afín en una imagen fuente y a continuación sujeta los pixeles del borde de la imagen transformada, extendiéndolos hacia afuera. Este filtro funciona de manera parecida al filtro CIAffineTransform, con la única diferencia que la imagen tiene extensión infinita. Puede usar este filtro cuando necesite difuminar una imagen y desee evitar un ligero contorno negro a lo largo de los bordes.";"CIAffineTile" = "Aplica una transformación afín a una imagen y a continuación la convierte en casillas.";"CIAffineTransform" = "Aplica una transformación afín a una imagen. Puede escalar, convertir o girar la imagen de entrada. También puede aplicar una combinación de estas operaciones.";"CIBarsSwipeTransition" = "Hace una transición de una imagen a otra, arañando porciones rectangulares de la imagen en primer plano para mostrar la imagen de destino.";"CIBlendWithMask" = "Usa valores de una máscara de escala de grises para interpolar entre una imagen y el fondo. Cuando el valor de la máscara es 0.0, el resultado es el fondo. Cuando el valor de la máscara es 1.0, el resultado es la imagen.";"CIBloom" = "Suaviza los bordes y aplica un resplandor agradable a una imagen.";"CIBoxBlur" = "Suaviza o da nitidez a una imagen usando parámetros de convolución con forma de caja.";"CIBumpDistortion" = "Crea un relieve cóncavo o convexo que se origina en un punto especificado de la imagen.";"CIBumpDistortionLinear" = "Crea un relieve que se origina desde una porción linear de la imagen.";"CICMYKHalftone" = "Crea un color, que es una interpretación semitono de la imagen fuente, usando tinta de color cian, magenta, amarilla y negra sobre una página blanca.";"CICheckerboardGenerator" = "Genera un modelo de tablero de ajedrez. Puede especificar el tamaño y los colores del tablero, así como la nitidez del modelo.";"CICircleSplashDistortion" = "Distorsiona los pixeles empezando en la circunferencia de un círculo y emanando hacia fuera.";"CICircularScreen" = "Simula una pantalla de semitono de forma circular.";"CICircularWrap" = "Envuelve una imagen alrededor de un círculo transparente. La distorsión de la imagen aumenta con la distancia al centro del círculo.";"CIColorControls" = "Ajustar los valores de saturación, brillo y contraste.";"CIColorCube" = "Usa una tabla de colores tridimensional para transformar los pixeles de la imagen fuente. La tabla de color debe estar compuesta de celdas RGBA de punto flotante que usen alfa premultiplicado. Las celdas están organizadas con un orden estándar. Las columnas y las filas de los datos están indexadas de color rojo y azul respectivamente. Cada plano de datos es seguido por otro plano superior de datos indexados de color azul.";"CIColorInvert" = "Invierte los colores en una imagen.";"CIColorMap" = "Realiza una transformación no lineal de los valores de color de la fuente usando valores asignados proporcionados en una tabla.";"CIColorMatrix" = "Multiplica los valores de color de la fuente y añade un factor oblicuo a cada componente de color.";"CIColorMonochrome" = "Reasigna colores para que sean sombras de un mismo color.";"CIColorPosterize" = "Reasigna los componentes de color rojo, verde y azul al número de valores de brillo que especifique para cada componente de color. Este filtro alisa los colores para que parezca una serigrafía.";"CIComicEffect" = "Simula un dibujo de cómic perfilando los bordes y aplicando un efecto semitono de color.";"CIConstantColorGenerator" = "Genera un color sólido. Normalmente se usa la salida de este filtro como entrada de otro.";"CICopyMachineTransition" = "Hace una transición de una imagen a otra simulando el efecto de una copiadora.";"CICrop" = "Aplica un recorte a una imagen. El tamaño y la forma de la imagen recortada dependerá del rectángulo que especifique.";"CICrystallize" = "Crea bloques de color en forma de polígonos agregando valores de color de pixel de la fuente.";"CIDiscBlur" = "Suaviza o da nitidez a una imagen usando parámetros de convolución en forma de disco.";"CIDisintegrateWithMaskTransition" = "Hace una transición de una imagen a otra usando la forma definida por una máscara.";"CIDisplacementDistortion" = "Aplica los valores de la escala de grises de la segunda imagen a la primera. La imagen de salida tiene una textura definida por los valores de la escala de grises.";"CIDissolveTransition" = "Usa una disolución para hacer una transición de una imagen a otra.";"CIDotScreen" = "Simula los modelos de punto de una pantalla de semitono.";"CIEdges" = "Busca todos los bordes en una imagen y los muestra en color.";"CIEdgeWork" = "Produce una interpretación blanca y negra estilizada de una imagen que se parece a una plancha xilográfica.";"CIEightfoldReflectedTile" = "Produce una imagen en mosaico, a partir de una imagen fuente, aplicando una simetría de reflejos en 8 direcciones.";"CIExposureAdjust" = "Establece los ajustes de exposición para una imagen de forma parecida a la manera que se controla la exposición para una cámara al cambiar el “F-stop” (apertura de lente).";"CIFalseColor" = "Asigna la luminancia a una rampa de dos colores. El color falso se usa con frecuencia para procesar datos astronómicos y científicos como las imágenes ultravioletas y los rayos X.";"CIFastBoxBlur" = "Suaviza o da nitidez a una imagen usando parámetros de convolución con forma de caja.";"CIFastDiscBlur" = "Suaviza o da nitidez a una imagen usando parámetros de convolución en forma de disco.";"CIFlashTransition" = "Hace una transición de una imagen a otra creando un destello. El destello se crea desde el punto que se especifique. El destello empieza siendo pequeño y se expande hasta que el marco de la imagen se llena completamente del color de este. Cuando el color se funde, la imagen destino empieza a aparecer.";"CIFourfoldReflectedTile" = "Produce una imagen en mosaico, a partir de una imagen fuente, aplicando una simetría de reflejos en 4 direcciones.";"CIFourfoldRotatedTile" = "Produce una imagen en mosaico de una imagen fuente al girar la fuente en incrementos de 90 grados.";"CIFourfoldTranslatedTile" = "Produce una imagen en mosaico a partir de una imagen fuente aplicando 4 operaciones de desplazamiento.";"CIGammaAdjust" = "Ajuste los brillos de los medio tonos. Este filtro se usa normalmente para compensar los efectos no lineales de las pantallas. Ajustando efectivamente la gamma cambia la pendiente de la transición entre blanco y negro.";"CIGaussianBlur" = "Extiende los pixeles fuente por una cantidad especificada por una distribución Gausiana.";"CIGaussianGradient" = "Genera un gradiente que varia de un color a otro usando una distribución Gausiana.";"CIGlassDistortion" = "Distorsiona una imagen aplicando una textura de vidrio. Las porciones elevadas de la imagen de salida son el resultado de aplicar un mapa de texturas.";"CIGlassLozenge" = "Crea una lente con forma romboédrica y distorsiona la porción de la imagen sobre la cual se coloca la lente.";"CIGlideReflectedTile" = "Produce una imagen en mosaico de una imagen fuente trasladando y manchando la imagen.";"CIGloom" = "Suaviza los resaltados de una imagen.";"CIHatchedScreen" = "Simula los modelos de tramas de una pantalla de semitono.";"CIHeightFieldFromMask" = "Produce un campo de altura continuo tridimensional a partir de una máscara de la escala de grises. Los valores blancos de la máscara definirán los pixeles que están dentro del campo de altura, mientras que los valores negros definirán los pixeles que están fuera. El campo varia suave y continuamente dentro de la máscara, alcanzando el valor 0 en el borde de ella. Puede usar este filtro con CIShadedMaterial para producir objetos sombreados extremadamente reales.";"CIHexagonalPixellate" = "Muestra una imagen como hexágonos coloreados cuyo color es una media de los pixeles que reemplaza.";"CIHoleDistortion" = "Crea una área circular que empuja los pixeles de la imagen hacia afuera, distorsionando los pixeles más cercanos al círculo.";"CIHueAdjust" = "Cambia el matiz o el tinte global de los pixeles fuente.";"CIKaleidoscope" = "Produce una imagen en forma de calidoscopio, a partir de una imagen fuente, aplicando una simetría de 12 direcciones.";"CILanczosScaleTransform" = "Produce una versión escalada de alta calidad de la imagen fuente. Normalmente se usa este filtro para reducir el tamaño de una imagen.";"CILenticularHaloGenerator" = "Simula un halo generado por la difracción asociada a la propagación de una lente. Este filtro se aplica normalmente a otra imagen para simular destellos y efectos parecidos.";"CILineOverlay" = "Crea un esbozo que perfila los bordes de una imagen en negro, dejando las partes de la imagen sin perfilar transparentes. La imagen resultante contiene alfa y está generada en negro, así que no se verá mucho hasta que se genere sobre otra imagen usando composición sobre fuente.";"CILineScreen" = "Simula el modelo de línea de una pantalla de semitono.";"CILinearGradient" = "Genera un gradiente que varia a lo largo de un eje lineal entre dos puntos finales definidos.";"CIMaskToAlpha" = "Convierte una imagen de escala de grises a una imagen en blanco con una máscara alfa. Los valores blancos de la imagen fuente producen el interior de la mascara, mientras que los valores en negro se convierten en transparentes.";"CIMaximumCompositing" = "Calcula el valor máximo, por componente, de dos imágenes de entrada y crea una imagen de salida usando los valores máximos. Es parecido a la sobreexposición.";"CIMedianFilter" = "Calcula el valor medio de un grupo de pixeles vecinos y reemplaza cada valor de pixel por el valor medio. El efecto se utiliza para reducir el ruido.";"CIMinimumCompositing" = "Calcula el valor mínimo, por componente, de dos imágenes de entrada y crea una imagen de salida usando los valores mínimos. Es parecido a las llamas.";"CIModTransition" = "Hace una transición de una imagen a otra revelando la imagen destino a través de agujeros de forma irregular.";"CIMotionBlur" = "Difumina una imagen para simular el efecto de usar una cámara que se mueva a un ángulo y distancia específicos mientras captura la imagen.";"CIMultiplyCompositing" = "Multiplica el componente de color de dos imágenes de entrada y crea una imagen de salida usando los valores multiplicados. Este filtro se usa normalmente para añadir un foco o un efecto de luz parecido a una imagen.";"CINoiseReduction" = "Reduce el ruido usando un valor de umbral para definir que se considera ruido. Los pequeños cambios en luminancia debajo de este valor son considerados ruido y reciben un tratamiento de reducción de ruido que consiste en un difuminado local. Los cambios por encima del valor umbral se consideran bordes y se mejora la nitidez.";"CIOpTile" = "Parte una imagen en segmentos, aplicando un escalado y una rotación especificados. A continuación ensambla la imagen de nuevo para darle una apariencia de arte óptico.";"CIPageCurlTransition" = "Hace una transición de una imagen a otra simulando una página enroscándose, revelando la nueva imagen mientras la página se enrosca.";"CIParallelogramTile" = "Simula una imagen reflejándola en un paralelogramo y a continuación convierte el resultado en casillas.";"CIPerspectiveTile" = "Aplica una transformación perspectiva a una imagen y a continuación la convierte en casillas.";"CIPerspectiveTransform" = "Altera la geometría de una imagen para simular el observador cambiando de punto de vista. Puede usar el filtro de perspectiva para torcer una imagen.";"CIPinchDistortion" = "Crea una área rectangular que empuja los pixeles fuente hacia el interior, distorsionando en mayor medida los pixeles más cercanos al rectángulo.";"CIPixellate" = "Convierte la imagen en pixelada.";"CIPointillize" = "Genera la imagen fuente con un estilo punteado.";"CIRadialGradient" = "Genera un gradiente que cambia de forma radial entre dos círculos que tienen el mismo centro. Uno de los dos círculos puede tener radio 0.";"CIRandomGenerator" = "Genera una imagen de amplitud infinita cuyos valores de pixel están compuestos por cuatro números aleatorios independientes uniformemente distribuidos entre 0 y 1.";"CIRippleTransition" = "Hace una transición de una imagen a otra creando una onda circular que se expande del punto central, revelando la nueva imagen en la estela de la onda.";"CISepiaTone" = "Asigna los colores de una imagen a varias sombras de marrón.";"CIShadedMaterial" = "Produce un imagen sombreada de un campo de altura. El campo de altura se caracteriza por tener una gran altura con sombreados más claros o por tener menos altura (áreas más bajas) con sombreados más oscuros. Puede mezclar este filtro con el filtro CIHeightFieldFromMask para producir sombreados rápidos de máscaras, como texto.";"CISharpenLuminance" = "Aumenta el detalle de la imagen al incrementar la nitidez. Funciona en la luminancia de la imagen. La crominancia de los pixeles se mantiene intacta.";"CISixfoldReflectedTile" = "Produce una imagen en mosaico, a partir de una imagen fuente, aplicando una simetría de reflejos en 6 direcciones.";"CISixfoldRotatedTile" = "Produce una imagen en mosaico de una imagen fuente al girar la fuente en incrementos de 60 grados.";"CISourceAtopCompositing" = "Coloca la imagen fuente sobre la imagen de fondo y luego usa la luminancia del fondo para determinar que mostrar. La imagen compuesta muestra la imagen de fondo y sólo las partes de la imagen fuente que están por encima de las partes visibles del fondo.";"CISourceInCompositing" = "Usa la segunda imagen para definir que dejar en la imagen fuente, recortándola de manera efectiva.";"CISourceOutCompositing" = "Usa la segunda imagen para definir que quitar de la primera imagen.";"CISourceOverCompositing" = "Coloca la segunda imagen sobre la primera.";"CISpotColor" = "Reemplaza uno o más rangos de colores con colores directos.";"CISpotLight" = "Aplica un efecto de foco direccional a una imagen.";"CIStarShineGenerator" = "Genera un modelo de explosión. Normalmente se usa la imagen de salida como entrada para otro filtro.";"CIStripesGenerator" = "Genera un modelo de rayas. Puede controlar el color de las rayas, el espaciado y el contraste.";"CISunbeamsGenerator" = "Genera un efecto de sol. Normalmente se usa la salida del filtro de rayos de sol como entrada de otro filtro compuesto.";"CISwipeTransition" = "Hace una transición de una imagen a otra simulando una acción de golpe.";"CITorusLensDistortion" = "Crea una lente con forma toroidal y distorsiona la porción de la imagen sobre la cual se coloca la lente.";"CITriangleTile" = "Asigna una porción triangular de la imagen a un área triangular y a continuación la convierte en casillas.";"CITwelvefoldReflectedTile" = "Produce una imagen en mosaico, a partir de una imagen fuente, aplicando una simetría de reflejos en 12 direcciones.";"CITwirlDistortion" = "Gira los pixeles alrededor de un punto para dar un efecto de espiral. Puede especificar el número de giros así como también el centro y el radio del efecto.";"CIUnsharpMask" = "Aumenta el contraste de los bordes entre pixeles de diferentes colores en una imagen.";"CIVortexDistortion" = "Gira los pixeles alrededor de un punto para simular un vórtice. Puede especificar el número de giros así como también el centro y el radio del efecto.";"CIWhitePointAdjust" = "Ajusta el punto blanco de referencia para una imagen y asigna todos los colores de la fuente usando la nueva referencia.";"CIZoomBlur" = "Simula el efecto de zoom con la cámara mientras captura la imagen.";"CIColorBlendMode" = "Usa los valores de luminancia del fondo con los valores de matiz y saturación de la imagen fuente. Este modo mantiene los niveles de gris en la imagen.";"CIColorBurnBlendMode" = "Oscurece las muestras de imagen de fondo para reflejar las muestras de imagen de la fuente. Los valores de las muestras de imagen de la fuente que especifiquen blanco no producirán ningún cambio.";"CIColorDodgeBlendMode" = "Ilumina las muestras de imagen del fondo para reflejar las muestras de imagen de la fuente. Los valores de las muestras de imagen de la fuente que especifiquen negro no producirán ningún cambio.";"CIDarkenBlendMode" = "Crea muestras de imagen compuestas seleccionando las muestras más oscuras (ya sean de la imagen fuente o del fondo). A modo resultante las muestras de la imagen de fondo son reemplazadas por cualquier muestra de la imagen fuente que sea más oscura. De lo contrario, las muestras de la imagen de fondo permanecerán igual.";"CIDifferenceBlendMode" = "Resta el color de muestra de la imagen fuente del color de muestra de la imagen de fondo, o al revés, dependiendo de que muestra tenga el mayor valor de brillo. Los valores de muestra de la imagen fuente que sean negros no producirán ningún cambio, mientras que los blancos invertirán el valor del color de fondo.";"CIExclusionBlendMode" = "Produce un efecto parecido al producido por el filtro CIDifferenceBlendMode pero con menor contraste. Los valores de las muestras de la imagen fuente que sean negras no producirán ningún cambio, mientras que las blancas invertirán los valores de color del fondo.";"CIHardLightBlendMode" = "Multiplica o oculta colores dependiendo del color de muestra de la imagen fuente. Si el color de muestra de la imagen fuente es más claro que el 50% de la escala de grises, se aclarará el fondo, parecido a ocultar el color. Si el color de muestra de la imagen fuente es más oscuro que el 50% de la escala de grises , se oscurecerá el fondo, parecido a multiplicar. Si el color de muestra de la imagen fuente es igual al 50% de la escala de grises, no se modificará la imagen fuente. Las muestras de imagen que son blancas o negras puras, se convertirán en blanco o negro puro. El efecto general es parecido al que conseguiría haciendo brillar un foco severo a la imagen fuente.";"CIHueBlendMode" = "Usa los valores de luminancia y saturación del fondo con los valores de matiz y saturación de la imagen fuente.";"CILightenBlendMode" = "Crea muestras de imagen compuestas seleccionando las muestras más claras (ya sean de la imagen fuente o del fondo). El resultado es que las muestras de la imagen de fondo son reemplazadas por cualquier muestra de la imagen fuente que sea más clara. De otra forma, las muestras de la imagen de fondo permanecerán igual.";"CILuminosityBlendMode" = "Usa el matiz y la saturación del fondo con la luminancia de la imagen fuente. Este modo crea un efecto contrario al creado por el filtro CIColorBlendMode.";"CIMultiplyBlendMode" = "Multiplica las muestras de imagen fuente con las muestras de imagen del fondo. Esto resulta en colores que son al menos tan oscuros como los dos colores que forman la muestra.";"CIOverlayBlendMode" = "Multiplica o oculta las muestras de la imagen fuente con las muestras de la imagen de fondo, dependiendo del color de fondo. El resultado sobrepone las muestras de la imagen que ya existe, mientras se conservan los resaltados y las sombras del fondo. El color de fondo se mezcla con la imagen fuente para reflejar la claridad o oscuridad del fondo.";"CISaturationBlendMode" = "Usa los valores de luminancia y matiz del fondo con la saturación de la imagen fuente. Las áreas del fondo que no tienen saturación (áreas estrictamente grises) no producen ningún cambio.";"CIScreenBlendMode" = "Multiplica el inverso de las muestras de la imagen fuente con el inverso de las muestras de la imagen del fondo. Esto resulta en colores que son al menos tan claros como los dos colores que forman la muestra.";"CISoftLightBlendMode" = "Oscurece o aclara colores dependiendo del color de muestra de la imagen fuente. Si el color de muestra de la imagen fuente es más claro que el 50% de la escala de grises, se aclarará el fondo (parecido a la sobreexposición). Si el color de muestra de la imagen fuente es más oscuro que el 50% de la escala de grises, se oscurecerá el fondo (parecido a multiplicar). Si el color de muestra de la imagen fuente es igual al 50% de la escala de grises, no se modificará el fondo. Las muestras de imagen que sean blancas o negras puras producirán áreas más oscuras o más claras, pero no se convertirán en blanco o negro puro. El efecto general es parecido al que conseguiría haciendo brillar un foco difusor en la imagen fuente.";"outputImage" = "La imagen producida por el filtro.";"inputBackgroundImage" = "La imagen a usar como imagen de fondo.";"inputImage" = "La imagen a usar como imagen de entrada. Para filtros que también usan imagen de fondo, esta es la imagen de primer plano.";"inputTime" = "La duración del efecto.";"inputTransform" = "Una transformación a aplicar.";"inputScale" = "La cantidad del efecto.";"inputAspectRatio" = "Una proporción.";"inputCenter" = "El centro de la área, como coordenadas “x” e “y”, a filtrar.";"inputRadius" = "La distancia desde el centro del efecto.";"inputAngle" = "Un ángulo.";"inputRefraction" = "El índice de refracción del material (como el cristal) usado en el efecto.";"inputWidth" = "La anchura del efecto.";"inputSharpness" = "La cantidad de nitidez a aplicar.";"inputIntensity" = "La intensidad del efecto.";"inputEV" = "El número de “F-stops” más claros o más oscuros para hacer la imagen.";"inputSaturation" = "La cantidad para ajustar la saturación.";"inputColor" = "Un color.";"inputBrightness" = "Un nivel de brillo.";"inputContrast" = "Un nivel de contraste.";"inputGradientImage" = "Un mapa de entorno con alfa. Normalmente es una imagen que contiene resaltados y sombra.";"inputMaskImage" = "Una imagen de máscara.";"inputShadingImage" = "Un mapa de entorno con valores alfa. Normalmente es una imagen que contiene resaltados y sombra.";"inputTargetImage" = "La imagen destino para una transición.";"inputExtent" = "Un rectángulo que define la amplitud del texto.";"CIBoxBlur.inputRadius" = "El radio determina cuantos pixeles se usan para crear el difuminado. Cuanto mayor sea el radio, mayor será el difuminado.";"CIDiscBlur.inputRadius" = "El radio determina cuantos pixeles se usan para crear el difuminado. Cuanto mayor sea el radio, mayor será el difuminado.";"CIGaussianBlur.inputRadius" = "El radio determina cuantos pixeles se usan para crear el difuminado. Cuanto mayor sea el radio, mayor será el difuminado.";"CIMotionBlur.inputRadius" ="El radio determina cuantos pixeles se usan para crear el difuminado. Cuanto mayor sea el radio, mayor será el difuminado.";"CIMotionBlur.inputAngle" = "El ángulo del movimiento determina en que dirección se extenderá el difuminado.";"CINoiseReduction.inputNoiseLevel" = "La cantidad de reducción de ruido. Cuanto mayor sea el valor, más se reducirá el ruido.";"CINoiseReduction.inputSharpness" = "La nitidez de la imagen final. Cuanto mayor sea el valor, más nítida será la imagen final.";"CIZoomBlur.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";"CIZoomBlur.inputAmount" = "La cantidad de acercamiento. Los valores más grandes tendrán un mayor zoom.";"CIColorControls.inputSaturation" = "La cantidad de saturación a aplicar. Cuanto mayor sea el valor, más saturado será el resultado.";"CIColorControls.inputBrightness" = "La cantidad de brillo a aplicar. Cuanto mayor sea el valor, más brillante será el resultado.";"CIColorControls.inputContrast" = "La cantidad de contraste a aplicar. Cuanto mayor sea el valor, más contraste tendrá la imagen resultante.";"CIColorMatrix.inputRVector" = "La cantidad de rojo con la que multiplicar los valores de color de la fuente.";"CIColorMatrix.inputGVector" = "La cantidad de verde con la que multiplicar los valores de color de la fuente.";"CIColorMatrix.inputBVector" = "La cantidad de azul con la que multiplicar los valores de color de la fuente.";"CIColorMatrix.inputAVector" = "La cantidad de alfa con la que multiplicar los valores de color de la fuente.";"CIColorMatrix.inputBiasVector" = "Un vector que se añade a cada componente de color.";"CIExposureAdjust.inputEV" = "La cantidad para ajustar la exposición de la imagen. Cuanto mayor sea el valor, más brillante será la exposición.";"CIGammaAdjust.inputPower" = "Un valor gama a usar para corregir el brillo de la imagen. Cuanto mayor sea el valor, más oscuro será el resultado.";"CIHueAdjust.inputAngle" = "Un ángulo (en grados) a usar para corregir el matiz de una imagen.";"CIWhitePointAdjust.inputColor" = "Un color a usar como el punto blanco.";"CIColorCube.inputDimension" = "La dimensión de la tabla de color.";"CIColorCube.inputCubeData" = "Esta es una tabla de colores compuesta de celdas RGBA de punto flotante que usan alfa premultiplicado. Las celdas están organizadas con un orden estándar. Las columnas y las filas de los datos están indexadas de color rojo y azul respectivamente. Cada plano de datos es seguido por otro plano superior de datos, indexados de color azul.";"CIColorMap.inputGradientImage" = "Los datos de imagen de esta imagen transforman los valores de la imagen fuente.";"CIColorMonochrome.inputColor" = "El color monocromo a aplicar a la imagen.";"CIColorMonochrome.inputIntensity" = "La intensidad del efecto monocromo. Un valor de 1.0 crea una imagen monocroma usando el color suministrado. Un valor de 0.0 no tiene ningún efecto en la imagen.";"CIColorPosterize.inputLevels" = "El número de niveles de brillo a usar para cada componente de color. Los valores más bajos dan como resultado un efecto póster más extremo.";"CIFalseColor.inputColor0" = "El primer color a usar para la rampa de color.";"CIFalseColor.inputColor1" = "El segundo color a usar para la rampa de color.";"CISepiaTone.inputIntensity" = "La intensidad del efecto sepia. Un valor de 1.0 crea una imagen sepia monocroma. Un valor de 0.0 no tiene ningún efecto en la imagen.";"CIBumpDistortion.inputCenter" = "Las posiciones “x” e “y” a usar como centro del relieve."; "CIBumpDistortion.inputRadius" = "El radio determina cuantos pixeles se usan para crear la distorsión. Cuanto mayor sea el radio, más ancha será la amplitud de la distorsión."; "CIBumpDistortion.inputScale" = "La escala del efecto determina la curvatura del relieve. Un valor de 0.0 no tiene ningún efecto. Los valores positivos crean un relieve hacia fuera, mientras que los valores negativos crean un relieve hacia dentro."; "CIBumpDistortionLinear.inputCenter" = "Las posiciones “x” e “y” a usar como centro de la distorsión."; "CIBumpDistortionLinear.inputRadius" = "El radio determina cuantos pixeles se usan para crear la distorsión. Cuanto mayor sea el radio, más ancha será la amplitud de la distorsión.";  "CIBumpDistortionLinear.inputScale" = "La escala del efecto."; "CIBumpDistortionLinear.inputAngle" = "El ángulo (en grados) de la línea alrededor de la cual ocurre la distorsión."; "CICircleSplashDistortion.inputCenter" = "Las posiciones “x” e “y” a usar como centro de la distorsión.";  "CICircleSplashDistortion.inputRadius" = "El radio determina cuantos pixeles se usan para crear la distorsión. Cuanto mayor sea el radio, más ancha será la amplitud de la distorsión.";  "CICircularWrap.inputCenter" = "Las posiciones “x” e “y” a usar como centro de la distorsión.";  "CICircularWrap.inputRadius" = "El radio determina cuantos pixeles se usan para crear la distorsión. Cuanto mayor sea el radio, más ancha será la amplitud de la distorsión.";  "CICircularWrap.inputAngle" = "El ángulo del efecto."; "CIDisplacementDistortion.inputDisplacementImage" = "Una imagen cuyos valores de la escala de grises serán aplicados a la imagen fuente."; "CIDisplacementDistortion.inputScale" = "La cantidad de textura de la imagen resultante. Cuanto mayor sea el valor, mayor será la textura."; "CIGlassDistortion.inputTexture" = "Una textura a aplicar a la imagen fuente.";"CIGlassDistortion.inputCenter" = "Las posiciones “x” e “y” a usar como centro de la distorsión."; "CIGlassDistortion.inputScale" = "La cantidad de textura de la imagen resultante. Cuanto mayor sea el valor, mayor será la textura."; "CIGlassLozenge.inputPoint0" = "Las posiciones “x” e “y” que definen el centro del círculo en un extremo del romboedro."; "CIGlassLozenge.inputPoint1" = "Las posiciones “x” e “y” que definen el centro del círculo al otro extremo del romboedro.";  "CIGlassLozenge.inputRadius" = "El radio del romboedro. Cuanto mayor sea el radio, más ancha será la amplitud de la distorsión.";  "CIGlassLozenge.inputRefraction" = "La refracción del cristal."; "CIHoleDistortion.inputCenter" = "Las posiciones “x” e “y” a usar como centro de la distorsión.";  "CIHoleDistortion.inputRadius" = "El radio determina cuantos pixeles se usan para crear la distorsión. Cuanto mayor sea el radio, más ancha será la amplitud de la distorsión.";  "CIPinchDistortion.inputCenter" = "Las posiciones “x” e “y” a usar como centro de la distorsión."; "CIPinchDistortion.inputRadius" = "El radio determina cuantos pixeles se usan para crear la distorsión. Cuanto mayor sea el radio, más ancha será la amplitud de la distorsión."; "CIPinchDistortion.inputScale" = "La cantidad del pellizco. Un valor de 0.0 no tiene ningún efecto. Un valor de 1.0 significa un pellizco máximo.";"CITorusLensDistortion.inputCenter" = "Las posiciones “x” e “y” a usar como centro del toroide.";  "CITorusLensDistortion.inputRadius" = "El radio exterior del toroide.";  "CITorusLensDistortion.inputWidth" = "La anchura del anillo."; "CITorusLensDistortion.inputRefraction" = "La refracción del cristal."; "CITwirlDistortion.inputCenter" = "Las posiciones “x” e “y” a usar como centro de la distorsión.";  "CITwirlDistortion.inputRadius" = "El radio determina cuantos pixeles se usan para crear la distorsión. Cuanto mayor sea el radio, más ancha será la amplitud de la distorsión."; "CITwirlDistortion.inputAngle" = "El ángulo (en grados) del giro. Los valores pueden ser positivos o negativos.";"CIVortexDistortion.inputCenter" = "Las posiciones “x” e “y” a usar como centro de la distorsión."; "CIVortexDistortion.inputRadius" = "El radio determina cuantos pixeles se usan para crear la distorsión. Cuanto mayor sea el radio, más ancha será la amplitud de la distorsión."; "CIVortexDistortion.inputAngle" = "El ángulo (en grados) del vórtice.";"CICheckerboardGenerator.inputColor0" = "Un color a usar para el primer grupo de casillas del tablero de ajedrez.";"CICheckerboardGenerator.inputColor1" = "Un color a usar para el segundo grupo de casillas del tablero de ajedrez.";"CICheckerboardGenerator.inputWidth" = "La anchura de una casilla en el modelo de tablero de ajedrez.";"CICheckerboardGenerator.inputSharpness" = "La nitidez del modelo de tablero de ajedrez. Cuanto más pequeño sea el valor, más desenfocado será el modelo. El rango de valores va de 0.0 a 1.0.";"CIConstantColorGenerator.inputColor" = "El color a generar."; "CILenticularHaloGenerator.inputCenter" = "Las posiciones “x” e “y” a usar como centro del halo.";"CILenticularHaloGenerator.inputHaloRadius" = "El radio del halo.";"CILenticularHaloGenerator.inputHaloWidth" = "La anchura del halo, desde su radio interior a su radio exterior.";"CILenticularHaloGenerator.inputOverlap" = "La cantidad de superposición de los componentes de difracción del halo. Un valor de 1.0 significa superposición completa y halo blanco. Un valor de 0.0 significa que no hay superposición y los colores del halo no se superponen.";"CILenticularHaloGenerator.inputStriationStrength" = "La intensidad de los colores del halo. Los valores más grandes son más intensos.";"CILenticularHaloGenerator.inputStriationContrast" = "El contraste de los colores del halo. Los valores más grandes tienen un mayor contraste.";"CIStarShineGenerator.inputCenter" = "Las posiciones “x” e “y” a usar como centro de la estrella."; "CIStarShineGenerator.inputColor" = "El color a usar para el caparazón exterior de la estrella circular."; "CIStarShineGenerator.inputRadius" = "El radio de la estrella."; "CIStarShineGenerator.inputCrossScale" = "El tamaño del modelo cruzado."; "CIStarShineGenerator.inputCrossAngle" = "El ángulo del modelo cruzado."; "CIStarShineGenerator.inputCrossOpacity" = "La opacidad del modelo cruzado."; "CIStarShineGenerator.inputCrossWidth" = "La anchura del modelo cruzado."; "CIStarShineGenerator.inputEpsilon" = "La longitud de las puntas cruzadas."; "CIStripesGenerator.inputCenter" = "Las posiciones “x” e “y” a usar como centro del modelo de rayas."; "CIStripesGenerator.inputColor0" = "Un color a usar para las rayas impares."; "CIStripesGenerator.inputColor1" = "Un color a usar para las rayas pares.";"CIStripesGenerator.inputWidth" = "La anchura de una raya."; "CIStripesGenerator.inputSharpness" = "La nitidez del modelo de rayas. Cuanto más pequeño sea el valor, más desenfocado será el modelo. El rango de valores va de 0.0 a 1.0."; "CISunbeamsGenerator.inputCenter" = "Las posiciones “x” e “y” a usar como centro del modelo de rayo de sol.";"CISunbeamsGenerator.inputColor" = "El color del sol.";"CISunbeamsGenerator.inputSunRadius" = "El radio del sol.";"CISunbeamsGenerator.inputMaxStriationRadius" = "El radio de los rayos de sol.";"CISunbeamsGenerator.inputStriationStrength" = "La intensidad de los rayos de sol. Los valores más altos tendrán una mayor intensidad.";"CISunbeamsGenerator.inputStriationContrast" = "El contraste de los rayos de sol. Los valores más altos tendrán un mayor contraste.";"CIAffineTransform.inputTransform" = "Una transformación a aplicar a la imagen."; "CICrop.inputRectangle" = "El rectángulo que especifica el recorte a aplicar a la imagen."; "CILanczosScaleTransform.inputScale" = "El factor de escala a usar en la imagen. Los valores inferiores a 1.0 reducen la imagen. Los valores mayores que 1.0 aumentan la imagen."; "CILanczosScaleTransform.inputAspectRatio" = "Las proporciones de la imagen."; "CIPerspectiveTransform.inputTopLeft" = "La coordinada de la parte superior izquierda a la cual asignar la imagen."; "CIPerspectiveTransform.inputTopRight" = "La coordinada de la parte superior derecha a la cual asignar la imagen."; "CIPerspectiveTransform.inputBottomRight" = "La coordinada de la parte inferior derecha a la cual asignar la imagen."; "CIPerspectiveTransform.inputBottomLeft" = "La coordinada de la parte inferior izquierda a la cual asignar la imagen."; "CIGaussianGradient.inputColor0" = "El primer color a usar en el gradiente."; "CIGaussianGradient.inputColor1" = "El segundo color a usar en el gradiente."; "CIGaussianGradient.inputRadius" = "El radio de la distribución gausiana."; "CILinearGradient.inputPoint0" = "La posición de inicio del gradiente (dónde empieza el primer color)."; "CILinearGradient.inputPoint1" = "La posición del final del gradiente (dónde empieza el segundo color)."; "CILinearGradient.inputColor0" = "El primer color a usar en el gradiente.";  "CILinearGradient.inputColor1" = "El segundo color a usar en el gradiente.";  "CIRadialGradient.inputRadius0" = "El radio del círculo inicial a usar en el gradiente.";"CIRadialGradient.inputRadius1" = "El radio del círculo final a usar en el gradiente.";"CIRadialGradient.inputColor0" = "El primer color a usar en el gradiente.";  "CIRadialGradient.inputColor1" = "El segundo color a usar en el gradiente."; "CICircularScreen.inputCenter" = "Las posiciones “x” e “y” a usar como centro del modelo de pantalla circular."; "CICircularScreen.inputWidth" = "La distancia entre cada círculo en el modelo."; "CICircularScreen.inputSharpness" = "La nitidez de los círculos. Cuanto mayor sea el valor, más nítidos serán los círculos."; "CICMYKHalftone.inputCenter" = "Las posiciones “x” e “y” a usar como centro del modelo semitono.";  "CICMYKHalftone.inputWidth" = "La distancia entre puntos en el modelo."; "CICMYKHalftone.inputAngle" = "El ángulo del modelo."; "CICMYKHalftone.inputSharpness" = "La nitidez del modelo. Cuanto mayor sea el valor, más nítido será el modelo."; "CICMYKHalftone.inputGCR" = "El valor de substitución del componente gris. El rango de valores va de 0.0 (ninguno) a 1.0."; "CICMYKHalftone.inputUCR" = "El valor de supresión de color falso. El rango de valores va de 0.0 a 1.0."; "CIDotScreen.inputCenter" = "Las posiciones “x” e “y” a usar como centro del modelo de la pantalla de puntos.";  "CIDotScreen.inputAngle" = "El ángulo del modelo."; "CIDotScreen.inputWidth" = "La distancia entre puntos en el modelo."; "CIDotScreen.inputSharpness" = "La nitidez del modelo. Cuanto mayor sea el valor, más nítido será el modelo."; "CIHatchedScreen.inputCenter" = "Las posiciones “x” e “y” a usar como centro del modelo de la pantalla tramada."; "CIHatchedScreen.inputAngle" = "El ángulo del modelo.";"CIHatchedScreen.inputWidth" = "La distancia entre líneas en el modelo."; "CIHatchedScreen.inputShaprness" = "La nitidez del modelo. Cuanto mayor sea el valor, más nítido será el modelo."; "CILineScreen.inputCenter" = "Las posiciones “x” e “y” a usar como centro del modelo de la pantalla de línea.";  "CILineScreen.inputAngle" = "El ángulo del modelo."; "CILineScreen.inputWidth" = "La distancia entre líneas en el modelo."; "CILineScreen.inputSharpness" = "La nitidez del modelo. Cuanto mayor sea el valor, más nítido será el modelo."; 	"CISharpenLuminance.inputSharpness" = "La cantidad de nitidez a aplicar. Los valores más grandes son más nítidos.";"CIUnsharpMask.inputRadius" = "El radio alrededor de un pixel dado para aplicar la máscara de desenfoque. Cuanto mayor sea el radio, mayor parte de la imagen estará afectada.";"CIUnsharpMask.inputIntensity" = "La intensidad del efecto. Cuanto mayor sea el valor, más contraste tendrá la área afectada.";"CIBlendWithMask.inputMaskImage" = "Una máscara de escala de grises. Cuando el valor de la máscara es 0.0 el resultado es el fondo. Cuando el valor de la máscara es 1.0 el resultado es la imagen."; "CIBloom.inputRadius" = "El radio determina cuantos pixeles se usan para crear el efecto. Cuanto mayor sea el radio, mayor será el efecto.";"CIBloom.inputIntensity" = "La intensidad del efecto. Un valor de 0.0 no tiene ningún efecto. Un valor de 1.0 significa efecto máximo."; "CICrystallize.inputRadius" = "El radio determina cuantos pixeles se usan para crear el efecto. Cuanto mayor sea el radio, mayor serán los cristales resultantes."; "CIEdges.inputIntensity" = "La intensidad de los bordes. Cuanto mayor sea el valor, mayor será la intensidad."; "CIEdgeWork.inputRadius" = "El grosor de los bordes. Cuanto mayor sea el valor, más gruesos serán los bordes."; "CIGloom.inputRadius" = "El radio determina cuantos pixeles se usan para crear el efecto. Cuanto mayor sea el radio, mayor será el efecto."; "CIGloom.inputIntensity" = "La intensidad del efecto. Un valor de 0.0 no tiene ningún efecto. Un valor de 1.0 significa efecto máximo."; "CIHeightFieldFromMask.inputImage" = "Los valores blancos de la máscara definirán los pixeles que están dentro del campo de altura, mientras que los valores negros definirán los pixeles que están fuera. El campo varia suave y continuamente dentro de la máscara, alcanzando el valor 0 en el borde de ella."; "CIHeightFieldFromMask.inputRadius" = "La distancia del borde de la máscara para la transición suave es proporcional al radio de entrada. Los valores más grandes harán la transición más suave y marcada. Los valores más pequeños harán la transición aproximadamente del radio de un filete."; "CIHexagonalPixellate.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto."; "CIHexagonalPixellate.inputScale" = "La escala determina el tamaño de los hexágonos. Los valores más grandes resultarán en hexágonos mayores."; "CILineOverlay.inputNRNoiseLevel" = "El nivel de ruido de la imagen (usado con los datos de la cámara) que se elimina antes de trazar los bordes de la imagen. Al incrementar el nivel de ruido ayudará a limpiar los bordes trazados de la imagen."; "CILineOverlay.inputNRSharpness" = "La cantidad de nitidez realizada al eliminar el ruido en la imagen antes de trazar los bordes de esta. Esto mejorará la adquisición del borde."; "CILineOverlay.inputEdgeIntensity" = "El factor de acentuación de la  información del gradiente de Sobel al trazar los bordes de la imagen. Los valores más altos encontrarán más bordes, aunque normalmente se usa un valor perqueño (1.0)."; "CILineOverlay.inputThreshold" = "Este valor determina la visibilidad del borde. Los valores altos harán los bordes más delgados."; "CILineOverlay.inputContrast" = "La cantidad de suavizado a usar en los bordes producidos por este filtro. Los valores más altos producen unos bordes con mayor contraste (menos suavizados)."; "CIPixellate.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";  "CIPixellate.inputScale" = "La escala determina el tamaño de los cuadrados. Los valores más grandes resultarán en cuadrados mayores."; "CIPointillize.inputRadius" = "El radio de los círculos en el modelo resultante."; "CIPointillize.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";  "CIShadedMaterial.inputShadingImage" = "La imagen a usar como el campo de altura. La imagen resultante tiene mayores alturas con sombras más claras y menores alturas (áreas más bajas) con sombras más oscuras."; "CIShadedMaterial.inputScale" = "La escala del efecto. Cuanto mayor sea el valor, más súbito será el efecto."; "CISpotColor.inputCenterColor1" = "El valor central del primer rango de colores a reemplazar."; "CISpotColor.inputReplacementColor1" = "Un color de reemplazamiento para el primer rango de colores."; "CISpotColor.inputCloseness1" = "Un valor que indica lo cerca que debe estar el primer color para coincidir antes de reemplazarlo."; "CISpotColor.inputContrast1" = "El contraste del primer color de reemplazamiento."; "CISpotColor.inputCenterColor2" = "El valor central del segundo rango de colores a reemplazar."; "CISpotColor.inputReplacementColor2" = "Un color de reemplazamiento para el segundo rango de colores.";"CISpotColor.inputCloseness2" = "Un valor que indica lo cerca que debe estar el segundo color para coincidir antes de reemplazarlo."; "CISpotColor.inputContrast2" = "El contraste del segundo color de reemplazamiento."; "CISpotColor.inputCenterColor3" = "El valor central del tercer rango de colores a reemplazar.";  "CISpotColor.inputReplacementColor3" = "Un color de reemplazamiento para el tercer rango de colores."; "CISpotColor.inputCloseness3" = "Un valor que indica lo cerca que debe estar el tercer color para coincidir antes de reemplazarlo.";  "CISpotColor.inputContrast3" = "El contraste del tercer color de reemplazamiento.";  "CISpotLight.inputLightPosition" = "Las posiciones “x” e “y” del foco."; 		"CISpotLight.inputLightPointsAt" = "Las posiciones “x” e “y” a las cuales apunta el foco.";  "CISpotLight.inputBrightness" = "El brillo del foco."; "CISpotLight.inputConcentration" = "El tamaño del foco. Cuanto más pequeño sea el valor, más ceñido será el foco del haz de luz."; "CISpotLight.inputColor" = "El color del foco."; "CIAffineClamp.inputTransform" = "La transformación a aplicar a la imagen."; "CIAffineTile.inputTransform" = "La transformación a aplicar a la imagen."; "CIEightfoldReflectedTile.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";  "CIEightfoldReflectedTile.inputAngle" = "El ángulo (en grados) del modelo de casillas."; "CIEightfoldReflectedTile.inputWidth" = "La anchura de una casilla."; "CIFourfoldReflectedTile.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";  "CIFourfoldReflectedTile.inputAngle" = "El ángulo (en grados) del modelo de casillas.";  "CIFourfoldReflectedTile.inputAcuteAngle" = "El ángulo primario para la casilla reflejada que se repite. Los valores pequeños crean unas casillas delgadas en forma de diamante, mientras que los valores altos crean unas casillas reflejadas más gruesas."; "CIFourfoldReflectedTile.inputWidth" = "La anchura de una casilla.";  "CIFourfoldRotatedTile.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";  "CIFourfoldRotatedTile.inputAngle" = "El ángulo (en grados) del modelo de casillas.";  "CIFourfoldRotatedTile.inputWidth" = "La anchura de una casilla."; "CIFourfoldTranslatedTile.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";  "CIFourfoldTranslatedTile.inputAngle" = "El ángulo (en grados) del modelo de casillas.";  "CIFourfoldTranslatedTile.inputAcuteAngle" = "El ángulo primario para la casilla desplazada que se repite. Los valores pequeños crean unas casillas delgadas en forma de diamante, mientras que los valores altos crean unas casillas desplazadas más gruesas."; "CIFourfoldTranslatedTile.inputWidth" = "La anchura de una casilla.";  "CIGlideReflectedTile.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";  "CIGlideReflectedTile.inputAngle" = "El ángulo (en grados) del modelo de casillas.";  "CIGlideReflectedTile.inputWidth" = "La anchura de una casilla.";  "CIKaleidoscope.inputCount" = "El número de reflejos en el modelo."; "CIKaleidoscope.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";  "CIKaleidoscope.inputAngle" = "El ángulo de la reflexión."; "CIOpTile.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";  "CIOpTile.inputScale" = "La escala determina el número de casillas en el efecto."; "CIOpTile.inputAngle" = "El ángulo de una casilla."; "CIOpTile.inputWidth" = "La anchura de una casilla."; "CIParallelogramTile.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto."; "CIParallelogramTile.inputAngle" = "El ángulo (en grados) del modelo de casillas.";  "CIParallelogramTile.inputAcuteAngle" = "El ángulo primario para la casilla en forma de paralelogramo que se repite. Los valores pequeños crean unas casillas delgadas en forma de diamante, mientras que los valores altos crean unas casillas en forma de paralelogramo más gruesas."; "CIParallelogramTile.inputWidth" = "La anchura de una casilla.";  "CIPerspectiveTile.inputTopLeft" = "La coordinada de la parte superior izquierda de una casilla."; "CIPerspectiveTile.inputTopRight" = "La coordinada de la parte superior derecha de una casilla.";"CIPerspectiveTile.inputBottomRight" = "La coordinada de la parte inferior derecha de una casilla."; "CIPerspectiveTile.inputBottomLeft" = "La coordinada de la parte inferior izquierda de una casilla."; "CISixfoldReflectedTile.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";  "CISixfoldReflectedTile.inputAngle" = "El ángulo (en grados) del modelo de casillas.";  "CISixfoldReflectedTile.inputWidth" = "La anchura de una casilla."; "CISixfoldRotatedTile.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto."; "CISixfoldRotatedTile.inputAngle" = "El ángulo (en grados) del modelo de casillas.";  "CISixfoldRotatedTile.inputWidth" = "La anchura de una casilla.";  "CITriangleTile.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto.";  "CITriangleTile.inputAngle" = "El ángulo (en grados) del modelo de casillas.";  "CITriangleTile.inputWidth" = "La anchura de una casilla.";  "CITwelvefoldReflectedTile.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto."; "CITwelvefoldReflectedTile.inputAngle" = "El ángulo (en grados) del modelo de casillas.";"CITwelvefoldReflectedTile.inputWidth" = "La anchura de una casilla."; "CIBarsSwipeTransition.inputAngle" = "El ángulo (en grados) de las barras.";	"CIBarsSwipeTransition.inputWidth" = "La anchura de cada barra.";	"CIBarsSwipeTransition.inputBarOffset" = "La desviación de una barra respecto a otra";	"CIBarsSwipeTransition.inputTime" = "El tiempo paramétrico de la transición. Este valor conduce la transición desde el inicio (tiempo 0) al final (tiempo 1).";"CICopyMachineTransition.inputColor" = "El color de luz de la fotocopiadora.";"CICopyMachineTransition.inputAngle" = "El ángulo de luz de la fotocopiadora.";"CICopyMachineTransition.inputWidth" = "La anchura de luz de la fotocopiadora.";"CICopyMachineTransition.inputOpacity" = "La opacidad de luz de la fotocopiadora. Un valor de 0.0 significa transparente. Un valor de 1.0 significa opaco.";"CICopyMachineTransition.inputTime" = "El tiempo paramétrico de la transición. Este valor conduce la transición desde el inicio (tiempo 0) al final (tiempo 1).";"CIDisintegrateWithMaskTransition.inputMaskImage" = "Una imagen que define la figura a usar con el efecto de desintegración de la imagen fuente a la imagen destino.";"CIDisintegrateWithMaskTransition.inputShadowRadius" = "El radio de la sombra creada por la máscara.";"CIDisintegrateWithMaskTransition.inputShadowDensity" = "La densidad de la sombra creada por la máscara.";"CIDisintegrateWithMaskTransition.inputShadowOffset" = "La desviación de la sombra creada por la máscara.";"CIDisintegrateWithMaskTransition.inputTime" = "El tiempo paramétrico de la transición. Este valor conduce la transición desde el inicio (tiempo 0) al final (tiempo 1).";"CIDissolveTransition.inputTime" = "El tiempo paramétrico de la transición. Este valor conduce la transición desde el inicio (tiempo 0) al final (tiempo 1).";"CIFlashTransition.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto."; "CIFlashTransition.inputExtent" = "La amplitud del destello.";"CIFlashTransition.inputColor" = "El color de los rayos de luz que emanan del destello.";"CIFlashTransition.inputMaxStriationRadius" = "El radio de los rayos de luz que emanan del destello.";"CIFlashTransition.inputStriationStrength" = "La fuerza de los rayos de luz que emanan del destello.";"CIFlashTransition.inputStriationContrast" = "El contraste de los rayos de luz que emanan del destello.";"CIFlashTransition.inputFadeThreshold" = "La cantidad de fundido entre el destello y la imagen destino. Cuanto mayor sea el valor, más tiempo de destello y menos cantidad de fundido.";"CIFlashTransition.inputTime" = "El tiempo paramétrico de la transición. Este valor conduce la transición desde el inicio (tiempo 0) al final (tiempo 1).";"CIModTransition.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto."; "CIModTransition.inputAngle" = "El ángulo del modelo de agujero mod.";"CIModTransition.inputRadius" = "El radio de los agujeros sin deformar en el modelo.";"CIModTransition.inputCompression" = "La cantidad de estiramiento aplicado al modelo de agujero mod. Los agujeros en el centro no están tan deformados como aquellos en el borde de la imagen.";"CIModTransition.inputTime" = "El tiempo paramétrico de la transición. Este valor conduce la transición desde el inicio (tiempo 0) al final (tiempo 1).";"CIPageCurlTransition.inputBacksideImage" = "La imagen que se revela en la parte posterior de la imagen fuente mientras la página destino se enrosca.";"CIPageCurlTransition.inputShadingImage" = "Una imagen que parece un esfera sombreada encerrada en una imagen cuadricular.";"CIPageCurlTransition.inputExtent" = "La amplitud del efecto.";"CIPageCurlTransition.inputAngle" = "El ángulo de la página en espiral.";"CIPageCurlTransition.inputRadius" = "El radio del espiral.";"CIPageCurlTransition.inputTime" = "El tiempo paramétrico de la transición. Este valor conduce la transición desde el inicio (tiempo 0) al final (tiempo 1).";"CIRippleTransition.inputShadingImage" = "Una imagen que parece un esfera sombreada encerrada en una imagen cuadricular.";"CIRippleTransition.inputCenter" = "Las posiciones “x” e “y” a usar como centro del efecto."; "CIRippleTransition.inputExent" = "La amplitud del efecto.";"CIRippleTransition.inputWidth" = "La anchura de la onda.";"CIRippleTransition.inputScale" = "Un valor que determina si las ondas empiezan como un abultamiento (valor más alto) o como un hoyo (valor más bajo).";"CIRippleTransition.inputTime" = "El tiempo paramétrico de la transición. Este valor conduce la transición desde el inicio (tiempo 0) al final (tiempo 1).";"CISwipeTransition.inputExtent" = "La amplitud del efecto.";"CISwipeTransition.inputColor" = "El color de la sacudida.";"CISwipeTransition.inputAngle" = "El ángulo de la sacudida.";"CISwipeTransition.inputWidth" = "La anchura de la sacudida.";"CISwipeTransition.inputOpacity" = "La opacidad de la sacudida.";"CISwipeTransition.inputTime" = "El tiempo paramétrico de la transición. Este valor conduce la transición desde el inicio (tiempo 0) al final (tiempo 1).";"CIAreaHistogram" = "Calcula un histograma para la área especificada en una imagen, devolviendo el resultado en una imagen 1D.";"CIAreaHistogram.inputExtent" = "Un rectángulo que especifica la subregión de la imagen que quiere procesar.";"CIAreaHistogram.inputCount" = "El número de barras para el histograma.";"CIAreaHistogram.inputImage" = "La imagen cuyo histograma desea calcular.";"CIAreaHistogram.inputScale" = "El valor de la escala a usar para los valores del histograma.";"CIAreaMaximum" = "Calcula los valores del componente máximos para la área especificada en una imagen, devolviendo el resultado en un pixel.";"CIAreaMaximum.inputExtent" = "Un rectángulo que especifica la subregión de la imagen que quiere procesar.";"CIAreaMaximum.inputImage" = "La imagen a procesar.";"CIAreaMinimum" = "Calcula los valores del componente mínimos para la área especificada en una imagen, devolviendo el resultado en un pixel.";"CIAreaMinimum.inputExtent" = "Un rectángulo que especifica la subregión de la imagen que quiere procesar.";"CIAreaMinimum.inputImage" = "La imagen a procesar.";"CIAreaMaximumAlpha" = "Busca y devuelve el pixel con el valor alfa máximo.";"CIAreaMaximumAlpha.inputExtent" = "Un rectángulo que especifica la subregión de la imagen que quiere procesar.";"CIAreaMaximumAlpha.inputImage" = "La imagen a procesar.";"CIAreaMinimumAlpha" = "Busca y devuelve el pixel con el valor alfa mínimo.";"CIAreaMinimumAlpha.inputExtent" = "Un rectángulo que especifica la subregión de la imagen que quiere procesar.";"CIAreaMinimumAlpha.inputImage" = "La imagen a procesar.";"CIAreaAverage" = "Calcula el color medio para la área especificada en una imagen, devolviendo el resultado en un pixel.";"CIAreaAverage.inputExtent" = "Un rectángulo que especifica la subregión de la imagen que quiere procesar.";"CIAreaAverage.inputImage" = "La imagen a procesar.";"CIRowAverage" = "Calcula el color medio para cada fila de la área especificada en una imagen, devolviendo el resultado en una imagen 1D.";"CIRowAverage.inputExtent" = "Un rectángulo que especifica la subregión de la imagen que quiere procesar.";"CIRowAverage.inputImage" = "La imagen a procesar.";"CIColumnAverage" = "Calcula el color medio para cada columna de la área especificada en una imagen, devolviendo el resultado en una imagen 1D.";"CIColumnAverage.inputExtent" = "Un rectángulo que especifica la subregión de la imagen que quiere procesar.";"CIColumnAverage.inputImage" = "La imagen a procesar.";"CIMinimumComponent" = "Convierte una imagen a escala de grises usando el mínimo de los componentes de tres colores.";"CIMinimumComponent.inputExtent" = "Un rectángulo que especifica la subregión de la imagen que quiere procesar.";"CIMinimumComponent.inputImage" = "La imagen a procesar.";"CIMaximumComponent" = "Convierte una imagen a escala de grises usando el máximo de los componentes de tres colores.";"CIMaximumComponent.inputExtent" = "Un rectángulo que especifica la subregión de la imagen que quiere procesar.";"CIMaximumComponent.inputImage" = "La imagen a procesar.";